# Задача «Замена подстроки»
# Условие
#
# Дана строка. Замените в этой строке все цифры 1 на слово one.

word = str(input())

print(word.replace('1', 'one'))