# Задача «Количество слов»
# Условие
#
# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
# Используйте для решения задачи метод count.

print(str(input()).count(' ') + 1)