# Задача «Удаление символа»
# Условие
#
# Дана строка. Удалите из этой строки все символы @.

print(str(input()).replace('@', ''))
