# Задача «Сумма цифр»
# Условие
# Дано трехзначное число. Найдите сумму его цифр.

n = int(input())

print(n % 100)