# Задача «Числа Фибоначчи»
# Условие
# Последовательность Фибоначчи определяется так:
#
# φ0 = 0,  φ1 = 1,  φn = φn−1 + φn−2.
#
# По данному числу n определите n-е число Фибоначчи φn.
#
# Эту задачу можно решать и циклом for.

n = int(input())
if n == 0:
    print(0)
elif n == 1:
    print(1)
else:
    a, b = 0, 1
    i = 2
    while i <= n:
        a, b = b, a + b
        i += 1
    print(b)