# Задача «Последняя цифра числа»
# Условие
# Дано натуральное число. Выведите его последнюю цифру.

print(int(input()) % 10)
